//全局资源配置字典
var errDict = {
	//RS 错误请求代码
	"RSE001" : "请求参数丢失或无效", 
	"RSE002" : "地址未注册或密码无效", 
	"RSE003" : "地址已经被注册",
	"RSE004" : "目标地址不存在",
	"RSE005" : "金额无效或余额不足",
	"RSE006" : "管理员验证失败",
	"RSE007" : "交易列表为空",
	"RSE008" : "指定的起止范围无效",
	"RSE009" : "没找到指定的交易记录",
	"RSE010" : "联系人列表为空",
	"RSE011" : "指定的消息ID无效或不属于该地址",
	"RSE012" : "没找到MID指定的消息",
	"RSE013" : "消息ID不属于指定地址",
	"RSE014" : "消息列表为空",
	"RSE015" : "消息可用条数不足",
	"RSE016" : "不支持的系统请求类型",
	"RSE017" : "指定的提现请求ID无效",
	"RSE018" : "提现请求列表为空",
	"RSE999" : "错误占位符号"
};

//正确字典
var okDict = {
	"RSY000" : "请求正常结束"
};

//检查指定编码是否有效的错误执行吗
exports.chkErrCode = function(code){
	//得到消息通道ID
	return errDict[code] ? true:false;
};
